<script setup>


import IconChevron from "@/components/icons/IconChevron.vue";
import IconBlueChevron from "@/components/icons/IconBlueChevron.vue";

const privacyPolicy = ref([
  {
    title: 'Введение',
    text: 'Данная политика конфиденциальности предоставляет информацию о том, как приложение BroVPN собирает, использует и предоставляет доступ к личным данным пользователей. Пожалуйста, внимательно ознакомьтесь с содержанием этой политики и обратитесь к ней, если у вас есть вопросы или требуется дополнительная информация.',
    isOpen: true
  },
  {
    title: 'Сбор и использование данных',
    text: '<ul>1. Типы данных: Приложение BroVPN может собирать следующие типы личных данных:</ul>' +
        '<li>Идентификационная информация (email, если указан).</li>' +
        '<li>Геолокационные данные.</li>' +
        '<li>Информация о трафике и использовании приложения.</li>' +
        '<ul>2. Цели использования: Собранные данные используются для:</ul>' +
        '<li>Обеспечения стабильного и безопасного соединения с VPN-серверами.</li>' +
        '<li>Мониторинга качества обслуживания и оптимизации сетевого трафика.</li>' +
        '<li>Предоставления агрегированной статистики использования приложения.</li>',
    isOpen: false
  },
  {
    title: 'Предоставление доступа к данным',
    text: 'Компания не передает данные третьим лицам за исключением случая указанного ниже </br>' +
        'Сервисы аналитики:\n</br>' +
        'Для улучшения качества обслуживания и оптимизации приложения мы можем сотрудничать с сторонними сервисами аналитики. Передача данных о трафике и использовании приложения может осуществляться только в анонимизированный и агрегированной форме, без раскрытия личной идентификационной информации.\n' +
        'Компания не передает данные третьим лицам за исключением случая указанного выше',
    isOpen: false
  },
  {
    title: 'Безопасность данных',
    text: '<ul>1. Процедуры обработки: для обеспечения безопасности данных применяются следующие процедуры:</ul>' +
        '<li>Шифрование трафика между устройством пользователя и VPN-сервером.</li>' +
        '<li>Регулярные аудиты безопасности для выявления и устранения потенциальных угроз.</li>' +
        '<li>Строгие правила доступа к данным для сотрудников..</li>' +
        '2.Доступ к данным: Доступ к личным данным имеют только уполномоченные сотрудники или подрядчики, обязанные соблюдать строгие правила конфиденциальности.\n',
    isOpen: false
  },
  {
    title: 'Хранение и удаление данных',
    text: '1. Сроки хранения: Личные данные хранятся только в течение периода, необходимого для обеспечения стабильного функционирования VPN-сервиса.</br>' +
        '2. Удаление данных: Пользователи могут запросить удаление своих личных данных, отправив запрос на bro@vnn.run с использованием зарегистрированного в приложении адреса электронной почты.\n',
    isOpen: false
  },
  {
    title: 'Ссылка и контакты',
    text: 'Данная политика конфиденциальности доступна по следующей Нашассылка В случае вопросов или запросов по вопросам конфиденциальности, вы можете связаться с нами по адресу Почта саппорта',
    isOpen: false
  },
])
</script>

<template>
<div class="privacy-policy">
  <h2>Политика конфиденциальности</h2>
  <div class="privacy-policy__container">
      <div class="item" v-for="item in privacyPolicy" @click="() => item.isOpen = !item.isOpen">
        <div class="item__header">
          <h6>{{item.title}}</h6>
          <icon-chevron :class="{'rotate': item.isOpen}" class="chevron"/>
        </div>
        <div v-if="item.isOpen">
          <p v-html="item.text"/>
        </div>
      </div>
  </div>
</div>
</template>

<style scoped lang="scss">
.privacy-policy {
  @include flex-container(column, flex-start, flex-start);
  gap: 48px;
  h2 {
    @include text-property(64px, 88px, 700);
  }
  &__container {
    width: 100%;
    background: #EBECF3;
    border-radius: 28px;
    & > :last-child {
      border-bottom: unset !important;
    }
    .item {
      @include flex-container(column, center, flex-start);
      padding: 20px 40px;
      gap: 12px;
      border-bottom: 2px solid rgb(118 118 128 / 20%);

      &__header {
        @include flex-container(row, space-between, center);
        width: 100%;
        h6 {
          @include text-property(32px, 40px, 500)
        }
        p {
          @include text-property(24px, 36px, 400)
        }
        .chevron {
          transition: transform .3s;
        }
        .rotate {
          transform: rotate(180deg);
          transition: transform .3s;
        }
      }
    }
  }
}
</style>